'''
Вычислите среднее арифметическое чисел 23, 5, 43, 17.
'''
# 1 способ (23+5+43+17)/4
numbers = [23, 5, 43, 17]
average = sum(numbers) / len(numbers)
print(average)