'''
Задание 1.5. Получите с помощью функции range следующие последовательности:
    1. [2, 4, 6, 8, 10, 12, 14, 16, 18]
    2. [50, 40, 30, 20, 10, 0, -10, -20, -30, -40, -50]
'''
seq1 = list(range(2, 20, 2))
print(seq1)

seq2 = list(range(50, -60, -10))
print(seq2)